[
    {
        "image": null,
        "description": "Melons are tender trailing plants that need lots of summer warmth to produce their sweet, juicy, aromatic fruits. They’re best grown in a greenhouse, although a few varieties may fruit outdoors in very warm locations or under cloches.If you fancy a challenge, why not give melons a try – you could get some delicious resultsMelons are not the easiest fruits to grow in the UK, especially outdoors, as they need heat,The concentration of water vapour in the atmosphere. This affects the rate at which plants transpire (lose water from their leaf pores), which in turn affects how much water their roots absorb from the soil. If air humidity is low, plants transpire quickly and become at risk of wilting if water is lost from the leaves faster than it can be absorbed by the roots. Different plants require different levels of humidity to thrive. Many tropical houseplants need high humidity and are best grown in a steamy bathroom, misted regularly or placed on a saucer of damp pebbles. In a greenhouse, humidity can be raised in hot weather by damping down (wetting) the floor or overhead misting.humidityand consistent moisture. Growing in a greenhouse or polytunnel is the best option and, if you look after them well, you may get up to six fruit per plant. Growing them outdoors is much more risky, even in a really warm, sheltered spot, although protective cloches should help.Melons (Cucumis melo) are closely related tocucumbersand have a similar style of growth, with vigorous scrambling stems, large leaves, yellow flowers and clinging tendrils. In a greenhouse they are usually grown up supports to save space.Two main types of sweet melons can be grown in the UK:\nThe concentration of water vapour in the atmosphere. This affects the rate at which plants transpire (lose water from their leaf pores), which in turn affects how much water their roots absorb from the soil. If air humidity is low, plants transpire quickly and become at risk of wilting if water is lost from the leaves faster than it can be absorbed by the roots. Different plants require different levels of humidity to thrive. Many tropical houseplants need high humidity and are best grown in a steamy bathroom, misted regularly or placed on a saucer of damp pebbles. In a greenhouse, humidity can be raised in hot weather by damping down (wetting) the floor or overhead misting.\nCantaloupe melons, with aromatic orange flesh – these are the best choice for growing outdoors but will do even better in a greenhouse\nHoneydew melons, smooth-skinned, with firm yellow flesh – best grown in a greenhouse\nWith good growing conditions and regular care, one melon plant should produce several fruit by late summer, giving you not only delicious rewards but a big sense of achievement too.",
        "type": "fruit",
        "name": "melons"
    },
    {
        "image": null,
        "description": "Sweet, succulent figs may sound like exotic treats for warmer climes, but if you choose the right variety, you can enjoy home-grown figs in the UK, in a mild, sunny site. In cooler locations, figs can be grown in containers and brought indoors over winter to protect the young fruitlets, or outdoor plants can be covered or wrapped. And with our warming climate, the range of suitable outdoor growing sites is continually expanding.Planted in a warm, sunny site, figs should produce plenty of delicious fruits that ripen by late summerLeft to their own devices, figs (Ficus carica) can grow into large bushy trees, with big hand-shaped leaves that are highly ornamental, bringing a tropical look to gardens. But if you want to maximise cropping, figs are best trained as a fan against a sunny wall and their roots restricted in a large container or with paving slabs inserted vertically around the rootball. Limiting their root-spread reduces their vigorous leafy growth and helps them focus on fruit production. Twice-yearly pruning also keeps these vigorous plants at a manageable size and improves fruiting. The seedless fruits develop withoutA process of sexual reproduction, which occurs after pollination. It can be defined as the fusion of the male gametes (pollen) with the female gametes (ovum).fertilisation(parthenocarpic fruit), soThe transfer of pollen grains from a male anther to a female stigma, either within the same flower or between two different flowers. It’s usually followed by fertilisation and seed production. Some flowers are pollinated by insects or other small creatures, others are wind pollinated. It’s also possible to pollinate flowers by hand, if you want to breed new plants or ensure successful pollination when there are few natural pollinators.pollinationis not need.Figs crop well in containers, either trained as a fan or as a small free-standing bush or tree, so can be grown in even the smallest garden in a warm, sunny spot. Keeping them in a pot is also useful in cooler regions, so they can be moved indoors over winter.In the cool UK climate, figs produce two crops a year, but only the first one usually ripens:\nA process of sexual reproduction, which occurs after pollination. It can be defined as the fusion of the male gametes (pollen) with the female gametes (ovum).\nThe transfer of pollen grains from a male anther to a female stigma, either within the same flower or between two different flowers. It’s usually followed by fertilisation and seed production. Some flowers are pollinated by insects or other small creatures, others are wind pollinated. It’s also possible to pollinate flowers by hand, if you want to breed new plants or ensure successful pollination when there are few natural pollinators.\nThe first cropis produced from embryonic figs that start to form in late summer at the branch tips. They stay as pea-sizeAn immature fruit, usually small.fruitletsuntil spring, then start into growth and ripen over summer. As the fruitlets form at the shoot tips, they are prone to frost damage, so winter protection is beneficial\nAn immature fruit, usually small.\nThe second cropforms on the current season’s shoots later in spring and early summer. These fruit rarely have time to ripen outdoors. They may reach a reasonable size, but will remain hard and green, so are best removed at the end of summer\nFig trees can also be grown in a greenhouse all year round, where they may possibly ripen both crops in a good summer.",
        "type": "fruit",
        "name": "figs"
    },
    {
        "image": null,
        "description": "Harvest medlars in autumn, then store them until they become softer and sweeterMedlar trees (Mespilus germanica) are easy to grow, productive, generally problem-free and need little pruning. They produce large white flowers in late spring, followed by small rounded fruits (about 5cm/2in across) for picking in autumn, and fiery-tinted autumn foliage.Medlar fruits are a curious delicacy, popular in medieval times but now not widely grown. Harvested in autumn when usually still hard, bitter and unripe, the small golden-brown fruits need to be stored for several weeks to ripen (or blet) until they are dark brown, soft, sweet and aromatic. They can then either be eaten (traditionally with cheese and port) or, more popularly, used to make afragrant amber jellyto accompany rich meats. They can also be used in sweet desserts. Medlar fruits are very rarely available to buy, although you may sometimes find medlar jelly, so the best way to enjoy these unusual fruits is to grow your own.Related RHS GuidesFascinating facts about medlars",
        "type": "fruit",
        "name": "medlars"
    },
    {
        "image": null,
        "description": "The transfer of pollen grains from a male anther to a female stigma, either within the same flower or between two different flowers. It’s usually followed by fertilisation and seed production. Some flowers are pollinated by insects or other small creatures, others are wind pollinated. It’s also possible to pollinate flowers by hand, if you want to breed new plants or ensure successful pollination when there are few natural pollinators.",
        "type": "fruit",
        "name": "quince"
    },
    {
        "image": null,
        "description": "Damson trees are easy to grow and produce heavy crops of small, juicy, blue-black fruits in late summer, as well as pretty blossom in early spring. The fruits are slightly astringent, with smooth, yellow-green flesh, and have a rich flavour ideal for many culinary uses, but particularly for jams and preserves.Damsons are smaller and less sweet than plums, but ideal for making into deliciously rich jams and dessertsDamsons (Prunusinsititia) are closely related toplums(Prunusdomestica) and have been grown in Britain since at least Roman times. Traditional damson-growing regions include Shropshire, Kent, Worcestershire, Westmorland (Cumbria) and Cheshire, where they were once grown in vast orchards. Some of the old regional varieties are still available, as well as several more recently bred options.The trees are simple to plant and like a warm, sunny spot with fertile soil that doesn’t get waterlogged. If you don’t have space for a free-standing tree, you can grow a fan-trained tree flat against a wall or fence, or a tree grafted on a dwarfing rootstock in a large container. In larger gardens, they make a great addition to a wildlife-friendlyhedgerowand are tough enough to act as awindbreak. Bees and other pollinators enjoy the blossom’s sweet nectar in spring.Damsons need little maintenance apart from annual pruning to keep them in good shape, and will reward you with plentiful harvests for years to come.",
        "type": "fruit",
        "name": "damsons"
    },
    {
        "image": null,
        "description": "Established redcurrant bushes crop prolifically, forming long trusses of vibrant fruitsRedcurrants (Ribes rubrum) are both productive and attractive, adorned with long clusters of glossy red fruits in summer. These shrubs can be grown in containers and are happy in sun or partial shade. They can also be trained into decorative and space-saving shapes, so really earn their keep, however small your garden. They are easy to plant and need little attention once settled in, apart from watering, feeding and pruning. Birds love the fruits too, so protect your crop with netting or a fruit cage once it starts to ripen.",
        "type": "fruit",
        "name": "redcurrants"
    },
    {
        "image": null,
        "description": "Plum trees fruit best in a warm, sheltered location in full sunPlum trees (Prunus domestica) are easy to grow and a must for any garden, offering heavy crops of fruit in mid- to late summer, as well as pretty spring blossom that attracts bees and other pollinators. There are lots of delicious types of plum to choose from, including classic rosy-yellow‘Victoria’plums, small juicygages, sweet golden mirabelles and dusky purpledamsons, ideal for jam.Plum trees are simple to plant and like a warm, sunny spot with fertile soil that doesn’t get waterlogged. If you don’t have space for a free-standing tree, you can grow a fan-trained tree flat against a wall or fence, or a dwarf tree in a large container. They need little maintenance apart from annual pruning to keep them in good shape, and will reward you with plentiful harvests for years to come.",
        "type": "fruit",
        "name": "plums"
    },
    {
        "image": null,
        "description": "Planted in a sunny, sheltered spot, ideally trained against a warm wall, a peach tree will reward you with pretty spring blossom followed by a crop of sweet, juicy, succulent fruits in summer. Compact varieties can also be grown in containers.Grow peaches in a warm, sunny location outdoors or in a greenhouseAlthough you may think peaches can only be grown in warmer climes, many varieties will crop successfully in the UK in a sunny, sheltered spot, such as against a south- or south-west-facing wall or in a container on a sunny patio. In fact, there is a long history of growing peaches in the UK – you’ll often find glass ‘peach houses’ in the walled kitchen gardens of stately homes, where peach trees were fan-trained against the back wall to provide ‘exotic’ fruit before the era of refrigerated transportation.Today, peaches can be grown outdoors as well as in a greenhouse, and in even the smallest of gardens. Peaches andnectarines(Prunus persica) are stone fruits, closely related toplums,cherriesandapricots. They make an attractive garden feature with their fragrant white or pink blossom in spring and luscious summer fruits – and what a treat to be able to pick and eat your own delicious, sweet peaches fresh from your garden!Related RHS GuidesFacts about peaches",
        "type": "fruit",
        "name": "peaches"
    },
    {
        "image": null,
        "description": "Growing in a warm, sheltered spot, cherry trees fruit abundantly every summerWith their delicious juicy fruits, pretty spring blossom and bright autumn foliage, cherry trees are an asset to any garden. Producing either sweet cherries for eating fresh or acid cherries for cooking, the trees come in various sizes to suit most gardens – if space is tight, you can grow a fan-trained cherry flat against a wall or fence, or even a dwarf tree in a large container.Cherries are closely related toplums,peaches,nectarinesandapricotsand enjoy similar growing conditions: namely fertile soil that doesn’t getDescribes soil or potting compost that is saturated with water. The water displaces air from the spaces between soil particles and plant roots can literally drown, unless they are adapted to growing in waterlogged conditions. Waterlogging is common on poorly drained soil or when heavy soil is compacted.waterloggedor dry out for long spells. For the sweetest fruits, plant in a sunny spot, although acid cherries (for cooking) will also crop well in partial shade. Many modern varieties are self-fertile, which means you only need one tree for a good crop. Just bear in mind that birds love cherries, so it’s best to net the tree or grow it in a fruit cage if you want the whole crop for yourself. To keep cherry trees in good shape and fruiting well, prune annually.\nDescribes soil or potting compost that is saturated with water. The water displaces air from the spaces between soil particles and plant roots can literally drown, unless they are adapted to growing in waterlogged conditions. Waterlogging is common on poorly drained soil or when heavy soil is compacted.",
        "type": "fruit",
        "name": "cherries"
    },
    {
        "image": null,
        "description": "The quintessential fruit of summer, strawberries taste best when home grown – of course!Sweet, juicy and delicious, strawberries (Fragaria×ananassa)are easy and rewarding to grow. Make your own strawberry patch if you have room, or just add a few plants to the front of a border. Alternatively, they grow well in containers and even hanging baskets.There are summer-fruiting, perpetual and alpine types to choose from, with many delicious varieties of each. And if you plant several different types, you can have home-grown harvests from early summer through to autumn. Many strawberries even produce new plantlets (or runners) after fruiting, so you can easily increase your plants every year or use them to replace older plants that are past their best.Related RHS GuidesFascinating facts about strawberries",
        "type": "fruit",
        "name": "strawberries"
    },
    {
        "image": null,
        "description": "Renowned for its distinctively bitter leaves, chicory comes in three main types –Artificially speeding up a plant’s growth, flowering or fruiting, usually by manipulation of temperature and light. Rhubarb and chicory can be forced in late winter by covering with a forcing jar or bucket, or by placing potted plants in the dark, to produce earlier, paler, sweeter growth. Hyacinths and other spring bulbs are often forced, so they flower earlier indoors.forcingchicory, where the young shoots are blanched in winter to produce small heads of pale, crisp leaves, and radicchio and sugarloaf varieties that can be harvested either as baby salad leaves or as large mature heads.Radicchio forms a colourful, rounded head of leaves by late summerChicory is easy to grow from seed, in a similar way tolettucesandendive, producing bitter, tangy leaves that are rather an acquired taste. The leaves can be made more palatable byThe technique of excluding light from parts of certain edible plants – including rhubarb, celery, leeks, chicory and sea kale – to make them more trender and taste sweeter. The new growth is often elongated and distinctively pale.blanchingthem (keeping them out of the light). This can be done by putting a bucket over the plant for a few weeks before harvesting, or it can happen naturally when the leaves in the centre of the head are covered by the outer ones.The three main types of chicory grown for eating are:\nArtificially speeding up a plant’s growth, flowering or fruiting, usually by manipulation of temperature and light. Rhubarb and chicory can be forced in late winter by covering with a forcing jar or bucket, or by placing potted plants in the dark, to produce earlier, paler, sweeter growth. Hyacinths and other spring bulbs are often forced, so they flower earlier indoors.\nThe technique of excluding light from parts of certain edible plants – including rhubarb, celery, leeks, chicory and sea kale – to make them more trender and taste sweeter. The new growth is often elongated and distinctively pale.\nForcing or Belgian chicory– grown for the crisp young leaf shoots, known as chicons, which are forced and blanched in winter to make them sweeter and less bitter. The most widely grown variety is ‘Witloof’\nRadicchio or red chicory– forms a tight head of usually deep red leaves with contrasting white veins, so is an attractive addition to the veg plot and the plate. Blanching isn’t necessary, as the inner leaves are protected from light, reducing their bitterness. The flavour becomes milder when the leaves are roasted or grilled\nSugarloaf or non-forcing chicory– produces large, hearted heads of crisp, green leaves, resembling a tall Cos lettuce, for harvesting in autumn. The tight heads are self-blanching. As its name implies, it has a sweeter flavour than the other types\nRadicchio and sugarloaf chicory can also be grown ascut-and-come-againleaves, harvested when young to add zing to mixed salads. They can besown repeatedlyin small batches for quick harvests almost all year round, if given protection in the colder months.With self-blanching chicory, the inner leaves are paler, more tender and less bitterIn addition to the culinary chicory varieties, you can also grow chicory (Cichorium intybus) as an ornamental plant, for its pretty blue flowers, which are popular with bees and other pollinators. It has edible but very bitter dandelion-like leaves. The roots have traditionally been used to make a coffee substitute.",
        "type": "vegetable",
        "name": "chicory"
    },
    {
        "image": null,
        "description": "Florence fennel is an attractive plant that forms a white ‘bulb’ at ground level made up of the overlapping, swollen bases of the leaf stalks. This has a sweet, mild aniseed flavour. It is also known as bulb fennel, although botanically it’s not a true bulb.Florence fennel (Foeniculum vulgare var. azoricum) is very closely related to the herbcommon fennel(F. vulgare)– for more on growing the latter, see ourguide to growing herb fennel.As Florence fennelThese are fleshy, rounded, underground storage organs, usually sold and planted while dormant. Examples include daffodils, tulips, hyacinths, lilies, onions and garlic. The term is often used to cover other underground storage organs, including corms, tubers and rhizomes.bulbsare fairly expensive to buy, it’s a prized crop to grow. However, it can be tricky, easilybolting(flowering), which means the bulb either doesn’t form or turns woody and inedible. It fares best in warm, damp summers and is well worth the effort if you can give it the right conditions. It may be less successful in colder regions and heavy clay soil.The key to success is to provide regular water, never letting the soil dry out, so plants keep growing strongly. Early to mid-summer is the best time to sow, once temperatures have warmed up. The bulbs take three or four months to mature, but you can harvest at any size –baby bulbscan be enjoyed after only about six weeks. Fennel bulbs can be eaten raw, sliced or grated into salads, or cooked in all kinds of dishes. The young feathery leaves can also be used as a flavouring.Florence fennel is a handsome, upright plant that takes up little ground space, so is ideal for small gardens and containers, as well as open ground. With its green feathery foliage, it’s ornamental as well as edible, making an attractive feature in any garden.\nThese are fleshy, rounded, underground storage organs, usually sold and planted while dormant. Examples include daffodils, tulips, hyacinths, lilies, onions and garlic. The term is often used to cover other underground storage organs, including corms, tubers and rhizomes.",
        "type": "vegetable",
        "name": "florence-fennel"
    },
    {
        "image": null,
        "description": "Globe artichokes (Cynara scolymus) are grown for their edible flower buds, produced over the summer months. Plants are highly ornamental, with big, jagged, silvery leaves and tall flower stems topped with large globe-shapedA bud is a small, undeveloped shoot that contains the potential for new growth. Buds are typically found on stems, where they can be apical (found at the tip) or axillary (found between leaf axils) and may develop into leaves, shoots or flowers.budsthat have pointed scales (sepals). Some varieties have particularly attractive dark purple or red-tinged buds. If left unharvested, the buds open into large purple thistle-like flowers, beloved bybeesand otherpollinating insects.These plants make a decorative addition to veg plots and flower borders, forming statuesque clumps up to 1.5m (5ft) tall and 90cm (3ft) wide. They are perennials, living for several years, with the top growth dying back in autumn, then re-sprouting in spring. Plants can be grown from seed or bought as young plants in spring, and clumps should be divided every four or five years, to produce new, more vigorous plants.Globe artichokes like warmth, full sun and free-draining soil, and once established need little maintenance. A mature plant can produce up to 12 edible buds over the summer months. Harvested when still tightly closed, small buds are delicious roasted or sautéed whole, while larger buds can be steamed, then the fleshy scale bases and heart eaten with a dressing.\nA bud is a small, undeveloped shoot that contains the potential for new growth. Buds are typically found on stems, where they can be apical (found at the tip) or axillary (found between leaf axils) and may develop into leaves, shoots or flowers.",
        "type": "vegetable",
        "name": "globe-artichokes"
    },
    {
        "image": null,
        "description": "These mildly flavoured members of theonionfamily, with their white stem bases (shanks) topped with a fountain of green leaves, are an attractive and popular crop to grow. Many varieties are hardy enough to stand up to the harshest weather without protection.Leeks usually reach maturity after four or five months, in autumn and winter, when other fresh crops may be in short supply, and they don’t have to be harvested straight away. You can leave leeks standing through the colder months and lift plants whenever you want them. There are also early varieties for harvesting in summer, often before they reach full size, as sweet, tender baby leeks, ideal if you’re short on space or want quicker results.Leeks are easy to grow from seed sown in spring and early summer, either indoors or outside. They’re often grown temporarily in a seedbed, thenMoving a plant from one growing position to another, often from a pot to its final spot in the garden.transplantedto their final position at a wider spacing, to make best use of available ground. For long white shanks, plant them deeply and pile earth up around them as they grow.You can harvest leeks at whatever size you wish. They have a delicious, sweet onion flavour. Baby leeks are tasty and tender, ideal for brazing, grilling or roasting, while mature leeks are hearty and bountiful – thinly slice, then sauté or steam, and use in casseroles, soups (leek and potato is a classic), stir-fries and many other dishes.Related RHS GuidesHardy winter vegetablesGrowing winter vegetablesHardy winter vegetables\nMoving a plant from one growing position to another, often from a pot to its final spot in the garden.",
        "type": "vegetable",
        "name": "leeks"
    },
    {
        "image": null,
        "description": "French beans (Phaseolusvulgaris) are an easy-to-grow crop, ideal for every size of garden, with both climbing and dwarf types to choose from. Grow them in the ground or incontainersin a warm, sunny spot for summer harvests of delicious stringless pods.Dwarf French beans take up little space and start to crop in just eight to ten weeksThere are compact, fast-cropping dwarf varieties, ideal for containers, and larger climbing varieties for growing up tall supports, providing a crop over a longer period. Both are easy to grow from seed in late spring or summer. Keep plants well watered, especially once they start flowering, and they should give a generous crop with little fuss. Just remember to pick regularly to encourage more pods to form.\nRelated RHS GuidesHow to grow runner beansHow to grow broad beansHow to grow beans for drying",
        "type": "vegetable",
        "name": "french-beans"
    },
    {
        "image": null,
        "description": "Broccoli, or sprouting broccoli, is a delicious, nutritious and easy-to-grow member of the cabbage family. It forms multiple small clusters of purple or whiteA bud is a small, undeveloped shoot that contains the potential for new growth. Buds are typically found on stems, where they can be apical (found at the tip) or axillary (found between leaf axils) and may develop into leaves, shoots or flowers.budsfor harvesting from summer onwards. Winter varieties provide especially valuable harvests right through to spring.Broccoli plants produce small clusters of buds for several months if harvested regularlyFirst, it’s worth defining what broccoli is, as it’s often confused with its close relativecalabrese. In a gardening context, broccoli (or sprouting broccoli) is a plant that produces small clusters of usually purple buds on the tips of long, leafy stems. Calabrese, on the other hand, produces a large central green head (that’s confusingly often called broccoli in supermarkets and recipes).Broccoli (Brassica oleracea(Italica Group)) produces repeated harvests for up to two months – it’s traditionally a winter/early spring crop, but newer varieties offer harvests from summer onwards, depending on the sowing time. The more compact, faster-growing summer varieties are best for smaller plots, while the more traditional winter and spring cropping varieties form large plants, up to 90cm (3ft) tall and wide, and can take eight months or more to mature. They provide a valuable crop at an otherwise lean time of year and you don’t need many plants to enjoy ample pickings. Sprouting broccoli can also be expensive to buy, so is well worth growing.Broccoli is a brassica, so should be grown with its other cabbagerelatives incrop rotations. It’s susceptible to the usual issues that affect brassicas  – seeProblemsbelow.Although broccoli is usually quite a slow crop, it can also be grown asmicrogreenson a sunny windowsill. Seeds will produce sprouts in about two weeks. The tasty, nutritiousAseedlingis a young plant grown from seed.seedlingscan be added to salads and sandwiches.\nA bud is a small, undeveloped shoot that contains the potential for new growth. Buds are typically found on stems, where they can be apical (found at the tip) or axillary (found between leaf axils) and may develop into leaves, shoots or flowers.\nAseedlingis a young plant grown from seed.",
        "type": "vegetable",
        "name": "broccoli"
    },
    {
        "image": null,
        "description": "Shallots are easy to grow from immatureThese are fleshy, rounded, underground storage organs, usually sold and planted while dormant. Examples include daffodils, tulips, hyacinths, lilies, onions and garlic. The term is often used to cover other underground storage organs, including corms, tubers and rhizomes.bulbsknown as sets, and can also be grown from seed. Planted in a warm sunny location, they’ll produce a good crop of sweet, tangy bulbs that can be stored for many months.Smaller, milder and sweeter than most onions, shallots are an easy crop for a sunny siteShallots (AlliumcepaAggregatum Group) are a type of small, sweet onion, and are just as easy to grow, with a similar need for full sun and free-draining soil. To grow from sets (immature bulbs), plant outdoors in autumn or spring, and they’ll produce a cluster of new bulbs to harvest from early summer onwards. They can also be grown from seed, which takes a little more time and effort, and produces a single bulb each.\nThese are fleshy, rounded, underground storage organs, usually sold and planted while dormant. Examples include daffodils, tulips, hyacinths, lilies, onions and garlic. The term is often used to cover other underground storage organs, including corms, tubers and rhizomes.",
        "type": "vegetable",
        "name": "shallots"
    },
    {
        "image": null,
        "description": "This unusual brassica isn’t widely available in supermarkets, so is well worth growing yourself. The swollen stem base, often called a bulb, can be green-, white- or purple-skinned, with pale green or white flesh inside. Kohl rabi is best harvested young, when tender, crisp and juicy, ideal for eating raw, grated into salads and coleslaws. It can also be lightly steamed, roasted or sautéed. It has a sweet flavour, like broccoli or mild turnip, to which it’s closely related. The leaves can also be cooked like greens.Seeds can be sown indoors or outside from mid-spring to mid-summer for summer harvests, and hardier purple varieties can also be sown from mid- to late summer for autumn and winter harvests. These later crops can often be stored successfully for several months in a cool place.Kohl rabi grows best in cool, damp weather. Always keep plants well watered, especially in hot, dry spells, to stop them turning woody or bolting. Unlike many brassicas, kohl rabi is fast growing, especially early in the year, so is ideal for filling gaps on the veg plot – you can harvest asbaby vegin as little as six weeks and at full size in around 12.",
        "type": "vegetable",
        "name": "kohl-rabi"
    },
    {
        "image": null,
        "description": "Home-grown, freshly picked peas are sweet and delicious – better than any you can buy in the supermarkets. They’re an easy crop to grow, with climbing and dwarf varieties taking up relatively little ground space, and if you sow several batches you can have harvests throughout the summer.Harvest peas every few days so you catch them at their best – young, sweet and deliciousThere are several types of peas (Pisum sativum) – peas for shelling (known as garden peas), as well as mangetouts and sugarsnaps – all grown in a similar way. The plants come in various sizes, from tall varieties that reach 1.8m (6ft), down to dwarf varieties of just 45cm (18in), so there are choices to suit all plots.\nSow small batches every few weeks from early spring, for harvests through summer and into autumn, and pick the pods regularly to encourage more to form. You can also harvest young pea shoots (which taste like peas) to add to salads.",
        "type": "vegetable",
        "name": "peas"
    },
    {
        "image": null,
        "description": "Delicious, juicy asparagus spears are relatively easy to grow, and although you won’t get a crop for the first couple of years, after that you’ll have reliable harvests every spring for up to 20 years.Succulent, tasty asparagus spears can be harvested for about eight weeks every springAsparagus needs a sheltered site with free-draining soil, where it can grow on its own in a dedicated bed. It’s usually planted asDormancy refers to a period of inactivity in plants, during which they slow down or stop their growth, conserving energy and resources. This is a natural process that helps them survive harsh conditions, such as winter or drought. Dormancy in seeds is a mechanism that prevents them germinating until environmental conditions are favourable for growth.dormantone-year-old plants known as crowns, but can also be grown from seed. Planting a new asparagus bed is an investment that will pay off in delicious harvests for years to come, but some initial patience is required – it’s best to let new plants get established for a few years before you cut your first spears.Asparagus is harvested for about eight weeks in spring and early summer, so is an annual treat to be anticipated and savoured. Asparagus spears are also quite expensive to buy, so are well worth growing if you have the space. An established plant should produce about 10 spears per season. After the harvesting period, shoots should be left to grow into tall ferny plants over the rest of the summer. Then simply cut them down to the ground in autumn, and they will re-sprout in spring, ready for harvesting again.Related RHS GuidesVideo: growing and harvesting asparagus\nDormancy refers to a period of inactivity in plants, during which they slow down or stop their growth, conserving energy and resources. This is a natural process that helps them survive harsh conditions, such as winter or drought. Dormancy in seeds is a mechanism that prevents them germinating until environmental conditions are favourable for growth.",
        "type": "vegetable",
        "name": "asparagus"
    },
    {
        "image": null,
        "description": "This popular leafy herb can be grown from seed indoors or bought as potted plants. Give basil warmth and sunshine, in containers or in the ground, for harvests of aromatic leaves all summer. These compact plants will thrive in the smallest garden, on doorsteps or balconies, or indoors on a bright kitchen windowsill.Basil (Ocimum) is a grown for its aromatic, peppery leaves. There are many kinds, from pungentsweet basilto spicy liquorice-infusedThai basil, as well as lemon,limeor cinnamon flavours. The deliciously fragrant leaves may beruffledor smooth,largeortiny, and various shades of green,redorpurple.Basil is not hardy. It likes growing in warm conditions so it's best in a greenhouse or on a kitchen windowsill. It can be grown outside in a UK summer, but it needs a sheltered, warm and sunny spot, either in the ground or in containers. Basil makes an attractive addition to herb gardens and veg plots, and even flower borders and pot displays, especially the more decorative varieties.It can be grown from seed sown or bought as young plants. It is usually treated as an annual and removed in autumn, as it won’t survive winter outdoors. Basil will eventually start to flower, which causes leaf quality to deteriorate. At this point plants can either be removed, or just enjoyed for their bee-friendly flowers in shades of white through to purple.Basil is widely used to make pesto and often added to tomato-based pasta sauces and salads. You can even use this versatile herb in fruit sorbets and ice-creams.",
        "type": "herb",
        "name": "basil"
    },
    {
        "image": null,
        "description": "Chamomile is easy to grow and makes an attractive addition to a herb collection, either in the ground or in containers, and can also be used in borders andwildflower plantings.Chamomile likes a sunny spot with free-draining soil, and is full hardy. The name chamomile derives from the Greek for ‘earth apple’, referring to its low-growing habit and apple-like scent. There are several types of chamomile with the characteristic, relaxing fragrance.",
        "type": "herb",
        "name": "chamomile"
    },
    {
        "image": null,
        "description": "Marjorams are easy to grow, sun-loving Mediterranean herbs. They're closely related tooreganoand the two groups are easily confused. There is a lot of overlap between them and the distinction is often not clear. In culinary terms, the main difference is flavour – marjoram’s leaves are usually milder and sweeter, while oregano is spicier and more pungent. They're all types ofOriganumand form low bushy mounds of aromatic foliage and rounded heads of small pink or white flowers in summer, up to 50cm (20in) tall. The flowers are very popular with bees and butterflies.Marjoram - origanum vulgare compactumMarjoram makes an attractive addition to herb gardens, containers and any sunny spot. There are several species and varieties, including the most common,sweet or knotted marjoram (Origanum majorana)andpot marjoram (O. onites)which generally need winter protection in all but the mildest parts of the UK whereasO. 'French'is a little hardier.Marjoram leaves can be picked in spring and summer and are widely used in Greek and Italian cuisine, especially in tomato, meat and poultry dishes. When used fresh, the leaves are usually added near the end of cooking, to maintain their flavour. They can also be sprinkled in salads or infused in oil, vinegar or salad dressings.",
        "type": "herb",
        "name": "marjoram"
    },
    {
        "image": null,
        "description": "Horseradish (Armoracia rusticana)forms a large leafy clump thatlooks like a very vigorous dock, about 60cm (2ft) tall and wide. This long-livedPerennials are plants that live for multiple years. They come in all shapes and sizes and fill our gardens with colourful flowers and ornamental foliage. Many are hardy and can survive outdoors all year round, while less hardy types need protection over winter. The term herbaceous perennial is used to describe long-lived plants without a permanent woody structure (they die back to ground level each autumn), distinguishing them from trees, shrubs and sub-shrubs.perennialis a member of thecabbage family (Brassicaceae), related tomustardandwasabi, and is fully hardy in the UK. It goesDormancy refers to a period of inactivity in plants, during which they slow down or stop their growth, conserving energy and resources. This is a natural process that helps them survive harsh conditions, such as winter or drought. Dormancy in seeds is a mechanism that prevents them germinating until environmental conditions are favourable for growth.dormantover winter, the leaves dying down in autumn then re-sprouting from the roots every spring.Horseradish leaf -Armoracia rusticanaIt is the long, thick roots that are harvested, in late autumn and winter – they are the key ingredient in fiery horseradish sauce, a traditional accompaniment to roast beef. Grated horseradish root will also add a hot, tangy kick to many other dishes, from pasta sauces to dips and coleslaw.Horseradish is very easy to grow, thriving in sun or partial shade – so much so that it can be hard to control if grown in the ground and its deep roots can be difficult to eradicate. But don’t let that put you off – simply grow it in a large pot. Then to harvest, just tip it out and take a root (or however many you need) from the clump and replant the rest back in the pot.\nPerennials are plants that live for multiple years. They come in all shapes and sizes and fill our gardens with colourful flowers and ornamental foliage. Many are hardy and can survive outdoors all year round, while less hardy types need protection over winter. The term herbaceous perennial is used to describe long-lived plants without a permanent woody structure (they die back to ground level each autumn), distinguishing them from trees, shrubs and sub-shrubs.\nDormancy refers to a period of inactivity in plants, during which they slow down or stop their growth, conserving energy and resources. This is a natural process that helps them survive harsh conditions, such as winter or drought. Dormancy in seeds is a mechanism that prevents them germinating until environmental conditions are favourable for growth.",
        "type": "herb",
        "name": "horseradish"
    },
    {
        "image": null,
        "description": "Sage (Salvia) is an attractive, drought-tolerant, easy-to-grow shrubby plant with aromatic, evergreen leaves that are often soft and downy. It also produces pretty flowers in mid- to late summer. This Mediterranean herb likes full sun in a warm, sheltered spot, in pots or free-draining soil, and should live for many years with minimal maintenance.There are many different types of sage, some grown as herbs for their edible, aromatic leaves, and others (usually known as salvias) as ornamental plants for their attractive flowers.Sage,Salvia officinalis'Berggarten'Sage,Salvia officinalis'Icterina'Common sage (Salvia officinalis) is the standard culinary sage. It forms a mound of aromatic, downy, olive-green leaves and produces attractive mauve flowers in early to mid-summer. It is hardy and evergreen, so keeps its leaves all year round, and can grow to up to 1m (3ft) tall and wide. Its flowers are both ornamental and wildlife friendly, providing nectar for pollinating insects.There are also many cultivated varieties ofS. officinalis, including the widely grown purple sage (S. officinalis ‘Purpurascens’) with its attractive, dusky purple, year-round foliage. Other varieties offer different aromas and various flower and foliage colours.Sage has a robust, peppery flavour that can be used in many dishes, not just in traditional sage and onion stuffing. You can add chopped sage leaves to soups, pasta sauces, sausages, marinades and more. Sage is also said to have many health benefits, and its botanical name Salvia derives from the Latin salvare meaning to heal.Rosemary has recently been reclassified as a type ofSalviaand is grown in a similar way to sage – for more about this popular herb, see ourguide to growing rosemary.",
        "type": "herb",
        "name": "sage"
    },
    {
        "image": null,
        "description": "Thyme (Thymus) is a compact evergreenshrubwith small aromatic leaves. It’s easy to grow in a warm, sunny spot, in free-draining soil or containers. It’s also drought tolerant and needs little maintenance once settled in.There are many varieties of thyme, with leaves of various flavours, scents and colours. In early summer, these low-growing shrubs are covered in clusters of tiny pink, mauve or white flowers that are rich in nectar, providing a feast for bees and other pollinating insects. Different varieties can be grown together to form a colourful collection.Thyme is an attractive essential for any herb garden, where it teams well with Mediterranean herbs such aslavender,sageandhyssop, which like similar growing conditions. It also makes an attractive, fragrant edging for sunny veg beds, Mediterranean-style borders andgravel garden.As thyme is evergreen, you can pick sprigs all year round, although the new growth in spring and summer has the best flavour. You can use the leaves fresh or dried in many dishes, and they’re a key ingredient in traditionalbouquet garniandherbes de Provence. The flowers are also edible.Related RHS GuidesHerbs: growingMediterranean garden plants",
        "type": "herb",
        "name": "thyme"
    },
    {
        "image": null,
        "description": "Savory may not be the most widely known herb, but its small, peppery-tasting leaves have many culinary uses. It’s not generally sold in supermarkets, so the best way to enjoy it is to grow your own. There are three types to choose from: annual summer savory (Satureja hortensis) and two evergreen perennials, winter savory (S. montana) and creeping savory (S. spicigera). They are all easy to grow and need little attention.Summer savory has a milder, more refined flavour, but is a short-lived annualAll three types of savory like full sun and free-draining conditions, in the ground or in containers. These attractive small plants take up little space and are ideal for growing alongside other Mediterranean herbs, such asrosemary,thymeandsage, in a herb patch,raised bedor large pot. The tiny white or mauve summer flowers also attract bees and otherpollinating insects. The narrow, aromatic leaves have a spicy flavour and are said to aid digestion. They are often used in bean and lentil dishes, and are a traditional flavouring in salami, stuffings and sausages. Summer savory is also a key ingredient inherbes de Provence.",
        "type": "herb",
        "name": "savory"
    },
    {
        "image": null,
        "description": "Grown for its spicy, pungent leaves, oregano is a sun-loving Mediterranean herb. Easy to grow, compact and drought tolerant, it thrives in pots or in the ground. It’s widely used in Italian and Greek cuisine, especially when dried.Oregano forms a low clump of small aromatic leaves and sends up attractive pink or white flowerheads in summer, about 30cm (1ft) tall. It’s a perennial, living for many years, and is usually hardy enough to survive the British winter if grown in a warm sunny spot, in a container or in free-draining soil.You can harvest the leaves regularly through spring and summer to enjoy in a wide range of dishes, infusing them with rich Mediterranean flavour. Oregano leaves are usually used dried, but can also be added fresh at the end of cooking. Dried oregano is a key ingredient in many pizza and pasta sauces, as it goes particularly well with tomato.Oregano looks great planted in a herb bed or herb container with other aromatic sun-lovers, such as marjoram, sage and thyme. It also works well in gravel gardens, dry gardens, Mediterranean-style plantings and pollinator-friendly borders, as the flowers are a magnet for butterflies and bees.Oregano and its close relative marjoram are often confused – they look very similar, like the same growing conditions and both are types of Origanum. There is a lot of overlap between them, but as a general distinction, oregano leaves tend to be spicier, more pungent and more often used dried, while marjoram leaves have milder, sweeter flavour and are usually used fresh.",
        "type": "herb",
        "name": "oregano"
    },
    {
        "image": null,
        "description": "Lemon balm is a bushyPerennials are plants that live for multiple years. They come in all shapes and sizes and fill our gardens with colourful flowers and ornamental foliage. Many are hardy and can survive outdoors all year round, while less hardy types need protection over winter. The term herbaceous perennial is used to describe long-lived plants without a permanent woody structure (they die back to ground level each autumn), distinguishing them from trees, shrubs and sub-shrubs.perennialherb with deliciously lemon-scented leaves and creamy-white or pale purple flowers in summer. It is vigorous and easy to grow in sun or light shade. The leaves give a lemony kick to salads, sauces and fish dishes, and make a refreshing herb tea.Lemon Balm Melissa officinalis 'All Gold'Lemon balm Melissa officinalis\nPerennials are plants that live for multiple years. They come in all shapes and sizes and fill our gardens with colourful flowers and ornamental foliage. Many are hardy and can survive outdoors all year round, while less hardy types need protection over winter. The term herbaceous perennial is used to describe long-lived plants without a permanent woody structure (they die back to ground level each autumn), distinguishing them from trees, shrubs and sub-shrubs.",
        "type": "herb",
        "name": "lemon-balm"
    },
    {
        "image": null,
        "description": "Sorrel is an easy, low-maintenance and hardyPerennials are plants that live for multiple years. They come in all shapes and sizes and fill our gardens with colourful flowers and ornamental foliage. Many are hardy and can survive outdoors all year round, while less hardy types need protection over winter. The term herbaceous perennial is used to describe long-lived plants without a permanent woody structure (they die back to ground level each autumn), distinguishing them from trees, shrubs and sub-shrubs.perennialwith edible, sharp-tasting leaves. Sorrel has long been grown as a medicinal and culinary herb, and before lemons became widely available it was used to add a tart, tangy flavour to many dishes.Red veined sorrelToday sorrel is mostly grown asA method of harvesting leafy crops so the plants continue to grow and sprout further leaves, providing several pickings over a long period. Snip off just a few outer leaves from each plant, rather than all of them, leaving the inner leaves to grow, for picking in a few weeks. Suitable candidates include lettuces and most types of salad leaves, as well as chard, spinach, mizuna and kale.cut and come againbaby leaves that give a sharp refreshing kick to salads. Leaves can also be cooked likespinachor used in sauces, soups and other dishes.There are three species often grown for eating:\nPerennials are plants that live for multiple years. They come in all shapes and sizes and fill our gardens with colourful flowers and ornamental foliage. Many are hardy and can survive outdoors all year round, while less hardy types need protection over winter. The term herbaceous perennial is used to describe long-lived plants without a permanent woody structure (they die back to ground level each autumn), distinguishing them from trees, shrubs and sub-shrubs.\nA method of harvesting leafy crops so the plants continue to grow and sprout further leaves, providing several pickings over a long period. Snip off just a few outer leaves from each plant, rather than all of them, leaving the inner leaves to grow, for picking in a few weeks. Suitable candidates include lettuces and most types of salad leaves, as well as chard, spinach, mizuna and kale.\nFrench or buckler-leaved sorrel(Rumex scutatus) – small shield-shaped leaves with lemony tang, ideal for adding to salads\nRed-veined sorrel(Rumex sanguineusvar.sanguineus) – the long, pointed leaves with a dark red mid-rib, veins and stem are both decorative and edible, with a sharp flavour\nBroad-leaved sorrel or common sorrel(Rumex acetosa) – a BritishA native plant is one that originated or arrived naturally in a particular place without human involvement. In the British Isles, native plants are those that were here during the last ice age or have arrived unaided since.nativeforming a clump of long leaves that have an astringent taste. Use baby leaves in salads or cook like spinach\nA native plant is one that originated or arrived naturally in a particular place without human involvement. In the British Isles, native plants are those that were here during the last ice age or have arrived unaided since.\nNativesheep’s sorrel(R. acetosella) is also edible, but not generally grown as a garden herb, although it is sometimes used as foraged wild leaves. Several species ofoxalisare also commonly known as sorrel, but these are ornamental plants, wildflowers or weeds.The three edible species of sorrel form low leafy plants, which are best harvested regularly to encourage a steady supply of fresh young leaves. Older leaves can become tough and bitter. They will send up tall flower spikes in summer, which should be removed if you want to keep picking the leaves. If the leaves get too large, simply cut them back to encourage fresh young growth.Sorrel is easy to grow from seed or can be bought as young plants, and is happy in sun or light shade, in most types of soil. Plants live for several years, dying back over winter then re-sprouting from the ground in spring – although young plants may be more productive, so you may prefer to sow them fresh each year.",
        "type": "herb",
        "name": "sorrel"
    }
]